// // 3. Напишите программу, которая будет выдавать
// название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница

Console.WriteLine("Введите номер дня недели");
int day = Convert.ToInt32(Console.ReadLine());



Console.WriteLine("Hello, World!");